Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/separation_agreement.html.txt.tmx
Source language: en
Languages: ga

source: If a married couple or civil partners can agree the terms on which they will live separately, they may enter into a separation agreement
ga: Más féidir le lánúin phósta nó le páirtnéirí sibhialta comhaontú a dhéanamh ar na téarmaí ar a mairfidh siad uathu féin, is féidir leo iontráil i gcomhaontú idirscartha

source: The essence of a separation agreement is that it is an agreement
ga: Is éard is comhaontú idirscartha ann, go bunúsach, ná comhaontú

source: Both parties must consent to the terms of the agreement
ga: Ní mór don bheirt pháirtithe toiliú a thabhairt do théarmaí an chomhaontaithe

source: The agreement is a legally binding contract setting out each party's rights and obligations to the other
ga: Bíonn an comhaontú ina chonradh atá ina cheanglas dlíthiúil ina leagtar amach cearta agus dualgais gach páirtí i leith an pháirtí eile

source: The terms of the agreement are usually reached either through mediation or negotiation through solicitors
ga: Baintear amach téarmaí an chomhaontaithe, de ghnáth, trí idirghabháil nó idirbheartaíocht le haturnaetha

source: If agreement can be reached reasonably quickly between the parties and a separation agreement drawn up, it is cheaper and less stressful than taking a court case
ga: Más féidir comhaontú a bhaint amach tapa a dhóthain idir na páirtithe agus má chuirtear comhaontú idirscartha i dtoll a chéile, bíonn costas níos saoire air seo agus baineann níos lú struis leis ná mar a bhíonn i gceist nuair a ghlactar cás cúirte

source: Many couples formalise their separation in this way
ga: Déanann go leor lánúineacha a n-idirscaradh foirmeálta ar an mbealach seo

source: Mediation is not marriage counselling
ga: Ní hionann idirghabháil agus comhairleoireacht pósta

source: Its purpose is not to help a couple to reconcile
ga: Ní hé cuspóir na hidirghabhála cabhrú le lánúin athmhuintearas a dhéanamh le chéile

source: Its purpose is to aid couples who have decided to separate to resolve any disputes they may have in relation to the key issues such as custody and access to children, maintenance and property rights
ga: Is é an cuspóirí atá aici chun cabhrú le lánúineacha a rinne an cinneadh chun idirscaradh óna chéile chun aon díospóidí a réiteach a d’fhéadfadh bheith acu i dtaca le saincheisteanna lárnacha, ar nós caomhnóireacht leanaí agus rochtana ar leanaí agus cearta cothabhála agus maoine

source: The mediator is neutral and encourages the separating couple to co-operate with each other in working out mutually acceptable arrangements that they will stick to
ga: Bíonn an t-idirghabhálaí neodrach agus spreagann sé/sí an lánúin idirscartha chun comhoibriú lena chéile chun socruithe a dheimhniú atá inghlactha dóibh beirt agus a gcloífidh siad leo

source: Any separating couple can avail of mediation, whether they are married or not
ga: Féadfaidh aon lánúin idirscartha idirghabháil a fháil, má bhíonn siad pósta nó a mhalairt

source: This includes same-sex couples
ga: Áirítear lánúineacha comhghnéis leis seo

source: Mediation normally takes up to six or seven sessions but this can vary depending on complexity
ga: Is gnách go nglacann idirghabháil a mhéid le sé nó seacht seisiún, ach braitheann seo ar chastacht an cháis

source: If agreement is reached, the mediator will draw up the terms of the agreement
ga: Má bhaintear comhaontú amach, cuirfidh an t-idirghabhálaí téarmaí an chomhaontaithe i dtoll a chéile

source: It is recommended that people seek independent legal advice before signing the agreement
ga: Moltar go lorgaíonn daoine comhairle neamhspleách dlí sula síníonn siad an comhaontú

source: Mediation is confidential and any communication with a mediator is not admissible if agreement is not reached and there are subsequent court proceedings
ga: Bíonn idirghabháil faoi rún agus ní cheadaítear aon chumarsáid a dhéanamh le hidirghabhálaí mura mbaintear comhaontú amach agus má leanann imeachtaí cúirte ina dhiaidh sin

source: It is advisable for couples who opt for mediation to ensure that they obtain legal and financial advice before attending mediation so that they know their rights and can make informed decisions
ga: Moltar do lánúineacha a roghnaíonn dul i mbun idirghabhála a chinntiú go bhfaigheann siad comhairle dlí agus airgeadais sula bhfreastalaíonn siad ar idirghabháil ionas gur fios dóibh a gcearta agus gur féidir leo cinntí feasacha a dhéanamh

source: Where the agreement is negotiated through solicitors, each party must have their own solicitor to ensure that they receive independent legal advice
ga: Sa chás go ndéantar idirghabháil trí aturnaetha, ní mór go mbeidh ag gach páirtí a n-aturnae féin lena chinntiú go bhfaigheann siad comhairle neamhspleách dlí

source: Collaborative practice is a way of resolving family law matters, including separation and divorce
ga: Is bealach atá i gcleachtas comhoibritheach chun ábhair dhlí teaghlaigh a réiteach, lena n-áirítear idirscaradh agus colscaradh

source: Both you and your spouse/partner work with collaborative lawyers
ga: Oibríonn tú féin agus do chéile/pháirtnéir le dlíodóirí comhoibritheacha

source: Everyone signs an agreement disqualifying your collaborative lawyers from representing you in court if the process breaks down
ga: Síníonn gach aon duine comhaontú a dhícháilíonn do dhlíodóirí comhoibritheacha ó ionadaíocht a dhéanamh duit sa chúirt má chliseann ar an bpróiseas

source: Neither lawyer can act for you in any contested court proceedings
ga: Ní féidir le ceachtar dlíodóir gníomhú i do leith in aon imeachtaí cúirte a chonspóidtear

source: Through face-to-face meetings, you and your spouse/civil partner discuss and resolve issues such as custody and access to children, maintenance and property rights
ga: Trí chruinnithe duine ar dhuine, déanfaidh tú féin agus do chéile/pháirtnéir plé agus réiteach ar shaincheisteanna ar nós caomhnóireacht leanaí agus rochtana ar leanaí mar aon le cearta cothabhála agus maoine

source: The process is dependent on both parties making full and frank disclosure of all of their assets so that negotiations can be open and honest
ga: Braitheann an próiseas ar an mbeirt pháirtithe agus go ndéanann siad nochtadh iomlán agus fírinneach dá gcuid sócmhainní uile ionas gur féidir leis na hidirbheartaíochtaí bheith oscailte agus iontaofa

source: If the process is successful you will have an agreement with your spouse/civil partner which you will both have had responsibility for
ga: Má éiríonn leis an bpróiseas, beidh comhaontú agat le do chéile/pháirtnéir as a mbeidh sibh beirt freagrach as

source: Not every lawyer is trained in collaborative law and it is likely to be more difficult to engage in the process if one of the lawyers is not so trained
ga: Níl oiliúint curtha ar gach dlíodóir i ndlí comhoibritheach, agus is dóchúil go mbeidh sé níos deacra tabhairt faoin bpróiseas murar cuireadh an oiliúint sin ar dhuine de na dlíodóirí

source: The actual document drawn up and signed by both parties, when they reach agreement, is often called a Deed of Separation and is a legally binding written contract
ga: Is minic a thugtar Gníomhas Idirscartha ar an gcáipéis féin a chuirtear i dtoll a chéile agus a shíníonn an bheirt pháirtithe, nuair a bhaineann siad comhaontú amach, agus is conradh scríofa atá ina cheanglas dlíthiúil é

source: The main issues dealt with in a separation agreement are as follows:
ga: Seo a leanas na príomh-shaincheisteanna lena ndéileáiltear i gcomhaontú idirscartha:

source: • An agreement to live apart
ga: • Comhaontú go gcónóidh an bheirt pháirtithe amach óna chéile

source: • Agreed arrangements in relation to custody and access to children
ga: • Socruithe comhaontaithe i dtaca le caomhnóireacht agus rochtain ar leanaí

source: • The occupation and ownership of the family/shared home and any other property
ga: • Cónaí agus úinéireacht maidir le teach an teaghlaigh/an teach comhroinnte agus aon mhaoin eile

source: • Maintenance and any lump sum payments
ga: • Íocaíochtaí cothabhála agus aon chnapshuimeanna

source: • Indemnity from the debts of the other spouse/civil partner
ga: • Slánú ó fhiachais an chéile/pháirtnéara shibhialta eile

source: It can be made into a rule of court by application to the court
ga: Féadtar riail chúirte a dhéanamh den Ghníomhas Idirscartha, ach iarratas a dhéanamh ar an gcúirt

source: This ensures that all the terms agreed upon can be legally enforced where covered by appropriate legislation
ga: Cinntíonn seo gur féidir na téarmaí go léir lenar comhaontaíodh a fhorfheidhmiú go dlíthiúil nuair a bhíonn siad cumhdaithe ag an reachtaíocht chuí

source: Information on making a separation agreement a rule of court is available on the Courts Service website
ga: Tá fáil ar fhaisnéis ar riail chúirte a dhéanamh de chomhaontú idirscartha ar láithreán gréasáin na Seirbhíse Cúirteanna

source: The Family Mediation Service is part of the Legal Aid Board and is free of charge
ga: Tá an tSeirbhís Idirghabhála Teaghlaigh saor in aisce

source: Alternatively you may choose to pay a private mediator
ga: Mar mhalairt air sin, féadfaidh tú a roghnú chun idirghabhálaí príobháideacha a íoc

source: If you are eligible for legal aid and advice from the Legal Aid Board, you must pay a contribution towards costs
ga: Má tá tú incháilithe do chúnamh agus do chomhairle dhlíthiúil a fháil ón mBord um Chúnamh Dlíthiúil, ní mór duit ranníocaíocht a íoc i dtreo na gcostas

source: The Legal Aid Board can provide you with a lawyer trained in collaborative practice
ga: Féadfaidh an Bord um Chúnamh Dlíthiúil dlíodóir a sholáthar duit ar ar cuireadh oiliúint i gcleachtas comhoibritheach

source: Private collaborative practitioners charge an hourly rate which you can agree in advance
ga: Gearrann cleachtóirí comhoibritheacha príobháideacha ráta san uair ar féidir leat comhaontú a dhéanamh air roimh ré

source: If you choose to hire a private solicitor, you should be aware that there is no fixed rate of charges for legal fees
ga: Ma roghnaíonn tú chun aturnae príobháideach a fháil, ba cheart duit a bheith feasach nach ann d’aon ráta seasta muirear le haghaidh táillí dlí

source: You are advised to obtain some quotes before deciding on a legal firm
ga: Moltar duit roinnt meastacháin luacha a fháil sula ndéanann tú cinneadh ar ghnóthas dlíthiúil

source: To enquire whether you are eligible for Legal Aid, contact your nearest law centre
ga: Chun fiosrúchán a dhéanamh faoi cibé acu an bhfuil tú incháilithe do Chúnamh Dlíthiúil, déan teagmháil leis an ionad dlí is gaire duit

source: The law centre staff will assess your means and advise on financial eligibility
ga: Déanfaidh foireann an ionaid dlí measúnú ar do mhaoin agus comhairle a chur ort faoi theidlíocht airgeadais

source: You can also check whether you may be financially eligible online
ga: Ina theannta sin, féadfaidh tú seiceáil an mbeifeá nó nach mbeifeá incháilithe i dtaobh cúrsaí airgeadais de, ar líne

source: If you wish to engage the services of a solicitor privately, the Law Society of Ireland maintains a list of registered solicitors throughout the country
ga: Más mian leat seirbhísí dlíodóra a fhostú go príobháideach, coimeádann Dlí-Chumann na hÉireann liosta de dhlíodóirí cláraithe ar fud na tíre

source: Search the directory of solicitor firms here
ga: Cuardaigh an t-eolaire de ghnóthais aturnaetha anseo

source: Contact the Family Mediation Service for more information about the service and a list of its centres throughout the country.To contact a private mediator, contact the Mediators Institute Ireland and it will provide you with a list of accredited mediators
ga: Déan teagmháil leis an tSeirbhís Idirghabhála Teaghlaigh chun teacht ar thuilleadh faisnéise faoin tseirbhís agus ar liosta dá n-ionaid ar fud na tíre. Chun teagmháil a dhéanamh le hidirghabhálaí, déan teagmháil le hInstitiúid idirghabhálaithe Éireann agus cuirfidh siad liosta d’idirghabhálaithe creidiúnaithe ar fáil duit

source: The Irish Assocation of Collaborative Professionals promotes the use of collaborative law
ga: Cuireann Cumann Ghairmithe Comhoibritheacha na hÉireann úsáid an dlí chomhoibrithigh chun cinn

source: You will find more information and lists of practioners on its website
ga: Tiocfaidh tú ar bhreis faisnéise agus ar liostaí de chleachtóirí ar a láithreán gréasáin

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Is eagraíocht neamhspleách dheonach iad FLAC (Ionaid Chomhairle Dlí Saor in Aisce) a oibríonn líonra de chlinicí um chomhairle dhlíthiúil ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún agus saor in aisce do chách

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Déan teagmháil le d’Ionad áitiúil um Fhaisnéis do Shaoránaigh chun teacht ar fhaisnéis ar sheirbhísí FLAC i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Ina theannta sin, tá líne faisnéise agus atreoraithe á reáchtáil ag an FLAC le linn uaireanta oifige le haghaidh faisnéis bhunúsach dhlíthiúil
